sphere-simpleFoam-MRF-zones-github/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

uinf 10.0;

internalField   uniform ($uinf 0 0);

boundaryField
{
    xmin
    {
        type            freestream;
        freestreamValue uniform ($uinf 0 0);
    }
    xmax
    {
        type            freestream;
        freestreamValue uniform ($uinf 0 0);
    }
    ymin
    {
        type            freestream;
        freestreamValue uniform ($uinf 0 0);
    }
    ymax
    {
        type            freestream;
        freestreamValue uniform ($uinf 0 0);
    }
    zmin
    {
        type            freestream;
        freestreamValue uniform ($uinf 0 0);
    }
    zmax
    {
        type            freestream;
        freestreamValue uniform ($uinf 0 0);
    }
    blades
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    c1
    {
        type            cyclic;
    }
    c2
    {
        type            cyclic;
    }

}

// ************************************************************************* //
